Repository: al1can/python-docs-tr
Catalog: tutorial/controlflow.po
Languages: tr

source: **Important warning:** The default value is evaluated only once. This makes a difference when the default is a mutable object such as a list, dictionary, or instances of most classes. For example, the following function accumulates the arguments passed to it on subsequent calls::
tr: **Önemli uyarı:** Varsayılan değer yalnızca bir kez değerlendirilir. Varsayılan değer liste, sözlük veya çoğu sınıfın örnekleri gibi değiştirilebilir bir nesne olduğunda bu durum fark yaratır. Örneğin, aşağıdaki fonksiyon sonraki çağrılarda kendisine aktarılan argümanları biriktirir::

source: This will print ::
tr: Bu şu çıktıyı verecektir ::

source: If you don't want the default to be shared between subsequent calls, you can write the function like this instead::
tr: Varsayılan değerin sonraki çağrılar arasında paylaşılmasını istemiyorsanız, bunun yerine fonksiyonu şu şekilde yazabilirsiniz::

source: Keyword Arguments
tr: Anahtar Kelime Değişkenleri

source: Functions can also be called using :term:`keyword arguments <keyword argument>` of the form ``kwarg=value``. For instance, the following function::
tr: Fonksiyonlar ayrıca ``kwarg=value`` şeklinde :term:`anahtar kelime argümanları <keyword argument>` kullanılarak da çağrılabilir. Örneğin, aşağıdaki fonksiyon::

source: accepts one required argument (``voltage``) and three optional arguments (``state``, ``action``, and ``type``). This function can be called in any of the following ways::
tr: bir gerekli argüman (``voltage``) ve üç isteğe bağlı argüman (``state``, ``action`` ve ``type``) kabul eder. Bu fonksiyon aşağıdaki yollardan herhangi biriyle çağrılabilir::

source: but all the following calls would be invalid::
tr: ancak aşağıdaki tüm çağrılar geçersiz olacaktır::

source: In a function call, keyword arguments must follow positional arguments. All the keyword arguments passed must match one of the arguments accepted by the function (e.g. ``actor`` is not a valid argument for the ``parrot`` function), and their order is not important. This also includes non-optional arguments (e.g. ``parrot(voltage=1000)`` is valid too). No argument may receive a value more than once. Here's an example that fails due to this restriction::
tr: Bir fonksiyon çağrısında, anahtar kelime argümanları konumsal argümanları takip etmelidir. Aktarılan tüm anahtar sözcük argümanları fonksiyon tarafından kabul edilen argümanlardan biriyle eşleşmelidir (örneğin ``actor`` ``parrot`` fonksiyonu için geçerli bir argüman değildir) ve sıraları önemli değildir. Buna isteğe bağlı olmayan argümanlar da dahildir (örneğin ``parrot(voltage=1000)`` da geçerlidir). Hiçbir argüman birden fazla değer alamaz. İşte bu kısıtlama nedeniyle başarısız olan bir örnek::

source: When a final formal parameter of the form ``**name`` is present, it receives a dictionary (see :ref:`typesmapping`) containing all keyword arguments except for those corresponding to a formal parameter. This may be combined with a formal parameter of the form ``*name`` (described in the next subsection) which receives a :ref:`tuple <tut-tuples>` containing the positional arguments beyond the formal parameter list. (``*name`` must occur before ``**name``.) For example, if we define a function like this::
tr: ``**name`` biçiminde bir son biçimsel parametre mevcut olduğunda, biçimsel parametreye karşılık gelenler dışındaki tüm anahtar kelime argümanlarını içeren bir sözlük alır (bkz. :ref:`typesmapping`). Bu, biçimsel parametre :ref:`tuple <tut-tuples>` listesinin ötesindeki konumsal argümanları içeren bir ``*name`` biçimindeki bir biçimsel parametre ile birleştirilebilir (bir sonraki alt bölümde açıklanmıştır). (``*name``, ``**name`` 'den önce gelmelidir.) Örneğin, aşağıdaki gibi bir fonksiyon tanımlarsak::

source: It could be called like this::
tr: Şöyle denebilir::

source: and of course it would print:
tr: ve tabii ki yazdıracaktır:

source: Note that the order in which the keyword arguments are printed is guaranteed to match the order in which they were provided in the function call.
tr: Anahtar sözcük bağımsız değişkenlerinin yazdırılma sırasının, fonksiyon çağrısında sağlandıkları sırayla eşleşmesinin garanti edildiğini unutmayın.

source: Special parameters
tr: Özel parametreler

source: By default, arguments may be passed to a Python function either by position or explicitly by keyword. For readability and performance, it makes sense to restrict the way arguments can be passed so that a developer need only look at the function definition to determine if items are passed by position, by position or keyword, or by keyword.
tr: Varsayılan olarak, argümanlar bir Python fonksiyonuna ya pozisyona göre ya da açıkça anahtar kelimeye göre aktarılabilir. Okunabilirlik ve performans için, argümanların geçirilme şeklini kısıtlamak mantıklıdır, böylece bir geliştiricinin öğelerin konumla mı, konumla ya da anahtar sözcükle mi yoksa anahtar sözcükle mi geçirildiğini belirlemek için yalnızca fonksiyon tanımına bakması gerekir.

source: A function definition may look like:
tr: Bir fonksiyon tanımı aşağıdaki gibi görünebilir:

source: where ``/`` and ``*`` are optional. If used, these symbols indicate the kind of parameter by how the arguments may be passed to the function: positional-only, positional-or-keyword, and keyword-only. Keyword parameters are also referred to as named parameters.
tr: burada ``/`` ve ``*`` isteğe bağlıdır. Kullanılırsa, bu semboller, argümanların fonksiyona nasıl geçirilebileceğine göre parametre türünü gösterir: yalnızca konumsal, konumsal veya anahtar sözcük ve yalnızca anahtar sözcük. Anahtar sözcük parametreleri, adlandırılmış parametreler olarak da adlandırılır.

source: Positional-or-Keyword Arguments
tr: Konumsal veya Anahtar Kelime Argümanları

source: If ``/`` and ``*`` are not present in the function definition, arguments may be passed to a function by position or by keyword.
tr: Eğer ``/`` ve ``*`` fonksiyon tanımında mevcut değilse, argümanlar bir fonksiyona pozisyon veya anahtar kelime ile aktarılabilir.

source: Positional-Only Parameters
tr: Yalnızca Konumsal Parametreler

source: Looking at this in a bit more detail, it is possible to mark certain parameters as *positional-only*. If *positional-only*, the parameters' order matters, and the parameters cannot be passed by keyword. Positional-only parameters are placed before a ``/`` (forward-slash). The ``/`` is used to logically separate the positional-only parameters from the rest of the parameters. If there is no ``/`` in the function definition, there are no positional-only parameters.
tr: Bu konuya biraz daha detaylı bakacak olursak, belirli parametreleri *positional-only* olarak işaretlemek mümkündür. Eğer *konumsal-sadece* ise, parametrelerin sırası önemlidir ve parametreler anahtar kelime ile aktarılamaz. Yalnızca konumsal parametreler bir ``/`` (ileri eğik çizgi) önüne yerleştirilir. ``/`` sadece konumsal parametreleri diğer parametrelerden mantıksal olarak ayırmak için kullanılır. Fonksiyon tanımında ``/`` yoksa, sadece konumsal parametre yoktur.

source: Parameters following the ``/`` may be *positional-or-keyword* or *keyword-only*.
tr: ``/`` işaretini takip eden parametreler *konumsal veya anahtar sözcük* veya *sadece anahtar sözcük* olabilir.

source: Keyword-Only Arguments
tr: Yalnızca Anahtar Sözcük İçeren Değişkenler

source: To mark parameters as *keyword-only*, indicating the parameters must be passed by keyword argument, place an ``*`` in the arguments list just before the first *keyword-only* parameter.
tr: Parametrelerin anahtar sözcük argümanıyla geçirilmesi gerektiğini belirterek parametreleri *anahtar sözcüğe özel* olarak işaretlemek için, argüman listesine ilk *anahtar sözcüğe özel* parametreden hemen önce bir ``*`` yerleştirin.

source: Function Examples
tr: Fonksiyon Örnekleri

source: Consider the following example function definitions paying close attention to the markers ``/`` and ``*``::
tr: ``/`` ve ``*`` işaretlerine çok dikkat ederek aşağıdaki örnek fonksiyon tanımlarını göz önünde bulundurun::

source: The first function definition, ``standard_arg``, the most familiar form, places no restrictions on the calling convention and arguments may be passed by position or keyword::
tr: İlk fonksiyon tanımı, ``standard_arg``, en bilinen biçimdir, çağırma kuralına herhangi bir kısıtlama getirmez ve argümanlar konum veya anahtar kelime ile aktarılabilir::

source: The second function ``pos_only_arg`` is restricted to only use positional parameters as there is a ``/`` in the function definition::
tr: İkinci fonksiyon ``pos_only_arg``, fonksiyon tanımında bir ``/`` olduğu için sadece konumsal parametreleri kullanacak şekilde sınırlandırılmıştır::

source: And the last uses all three calling conventions in the same function definition::
tr: Sonuncusu ise aynı fonksiyon tanımında üç çağrı kuralını da kullanır::

source: Finally, consider this function definition which has a potential collision between the positional argument ``name`` and ``**kwds`` which has ``name`` as a key::
tr: Son olarak, ``name`` konumsal argümanı ile ``name`` anahtarına sahip ``**kwds`` arasında potansiyel bir çakışma olan bu fonksiyon tanımını düşünün::

source: There is no possible call that will make it return ``True`` as the keyword ``'name'`` will always bind to the first parameter. For example::
tr: Anahtar kelime ``'name'`` her zaman ilk parametreye bağlanacağı için ``True`` döndürmesini sağlayacak olası bir çağrı yoktur. Örneğin::

source: But using ``/`` (positional only arguments), it is possible since it allows ``name`` as a positional argument and ``'name'`` as a key in the keyword arguments::
tr: Ancak ``/`` (yalnızca konumsal argümanlar) kullanıldığında, ``name`` bir konumsal argüman olarak ve ``'name'`` anahtar kelime argümanlarında bir anahtar olarak izin verdiği için mümkündür::

source: In other words, the names of positional-only parameters can be used in ``**kwds`` without ambiguity.
tr: Başka bir deyişle, yalnızca konumsal parametrelerin adları ``**kwds`` içinde belirsizlik olmadan kullanılabilir.

source: Recap
tr: Özet

source: The use case will determine which parameters to use in the function definition::
tr: Kullanım durumu, fonksiyon tanımında hangi parametrelerin kullanılacağını belirleyecektir::

source: As guidance:
tr: Rehber olarak:

source: Use positional-only if you want the name of the parameters to not be available to the user. This is useful when parameter names have no real meaning, if you want to enforce the order of the arguments when the function is called or if you need to take some positional parameters and arbitrary keywords.
tr: Parametrelerin adının kullanıcı tarafından kullanılamamasını istiyorsanız sadece pozisyonel seçeneğini kullanın. Bu, parametre adlarının gerçek bir anlamı olmadığında, fonksiyon çağrıldığında bağımsız değişkenlerin sırasını zorlamak istediğinizde veya bazı konumsal parametreler ve rastgele anahtar sözcükler almanız gerektiğinde kullanışlıdır.

source: Use keyword-only when names have meaning and the function definition is more understandable by being explicit with names or you want to prevent users relying on the position of the argument being passed.
tr: Adların bir anlamı olduğunda ve fonksiyon tanımının adlarla açık olmasıyla daha anlaşılır olduğunda veya kullanıcıların geçirilen argümanın konumuna güvenmesini önlemek istediğinizde yalnızca anahtar sözcük kullanın.

source: For an API, use positional-only to prevent breaking API changes if the parameter's name is modified in the future.
tr: Bir API için, parametrenin adı gelecekte değiştirilirse API değişikliklerinin bozulmasını önlemek için yalnızca konumsal kullanın.

source: Arbitrary Argument Lists
tr: Keyfi Argüman Listeleri

source: Finally, the least frequently used option is to specify that a function can be called with an arbitrary number of arguments. These arguments will be wrapped up in a tuple (see :ref:`tut-tuples`). Before the variable number of arguments, zero or more normal arguments may occur. ::
tr: Son olarak, en az kullanılan seçenek, bir fonksiyonun rastgele sayıda argümanla çağrılabileceğini belirtmektir. Bu argümanlar bir tuple içinde paketlenecektir (bkz :ref:`tut-tuples`). Değişken argüman sayısından önce, sıfır veya daha fazla normal argüman olabilir. ::

source: Normally, these *variadic* arguments will be last in the list of formal parameters, because they scoop up all remaining input arguments that are passed to the function. Any formal parameters which occur after the ``*args`` parameter are 'keyword-only' arguments, meaning that they can only be used as keywords rather than positional arguments. ::
tr: Normalde *variadic* argümanlar biçimsel parametreler listesinde en sonda yer alır, çünkü fonksiyona aktarılan geri kalan tüm girdi argümanlarını toplarlar. ``*args`` parametresinden sonra gelen tüm biçimsel parametreler 'keyword-only' (yalnızca-anahtar-kelime) argümanlarıdır, yani konumsal argümanlar yerine sadece anahtar kelimeler olarak kullanılabilirler. ::

source: Unpacking Argument Lists
tr: Argüman Listelerini Açma

source: The reverse situation occurs when the arguments are already in a list or tuple but need to be unpacked for a function call requiring separate positional arguments. For instance, the built-in :func:`range` function expects separate *start* and *stop* arguments. If they are not available separately, write the function call with the ``*``\ -operator to unpack the arguments out of a list or tuple::
tr: Tersi durum, argümanlar zaten bir liste veya tuple içinde olduğunda, ancak ayrı konumsal argümanlar gerektiren bir fonksiyon çağrısı için paketten çıkarılması gerektiğinde ortaya çıkar. Örneğin, yerleşik :func:`range` fonksiyonu ayrı *start* ve *stop* argümanları bekler. Eğer bunlar ayrı olarak mevcut değilse, argümanları bir listeden veya tuple'dan çıkarmak için fonksiyon çağrısını ``*``\ -operatörü ile yazın::

source: In the same fashion, dictionaries can deliver keyword arguments with the ``**``\ -operator::
tr: Aynı şekilde, sözlükler ``**``\ -operatörü ile anahtar sözcük argümanları sunabilir::

source: Lambda Expressions
tr: Lambda İfadeleri

source: Small anonymous functions can be created with the :keyword:`lambda` keyword. This function returns the sum of its two arguments: ``lambda a, b: a+b``. Lambda functions can be used wherever function objects are required. They are syntactically restricted to a single expression. Semantically, they are just syntactic sugar for a normal function definition. Like nested function definitions, lambda functions can reference variables from the containing scope::
tr: Küçük anonim fonksiyonlar :keyword:`lambda` anahtar sözcüğü ile oluşturulabilir. Bu fonksiyon iki argümanının toplamını döndürür: ``lambda a, b: a+b``. Lambda fonksiyonları, fonksiyon nesnelerinin gerekli olduğu her yerde kullanılabilir. Sözdizimsel olarak tek bir ifadeyle sınırlıdırlar. Anlamsal olarak, normal bir fonksiyon tanımı için sadece sözdizimsel şekerdirler. İç içe işlev tanımları gibi, lambda işlevleri de içeren kapsamdaki değişkenlere başvurabilir::

source: The above example uses a lambda expression to return a function. Another use is to pass a small function as an argument::
tr: Yukarıdaki örnekte bir fonksiyon döndürmek için bir lambda ifadesi kullanılmıştır. Başka bir kullanım da küçük bir fonksiyonu argüman olarak geçirmektir::

source: Documentation Strings
tr: Dokümantasyon Stringler'i

source: Here are some conventions about the content and formatting of documentation strings.
tr: Belge dizelerinin içeriği ve biçimlendirilmesiyle ilgili bazı kurallar aşağıda verilmiştir.

source: The first line should always be a short, concise summary of the object's purpose. For brevity, it should not explicitly state the object's name or type, since these are available by other means (except if the name happens to be a verb describing a function's operation). This line should begin with a capital letter and end with a period.
tr: İlk satır her zaman nesnenin amacının kısa ve öz bir özeti olmalıdır. Öz olması için, nesnenin adı veya türü açıkça belirtilmemelidir, çünkü bunlar başka yollarla elde edilebilir (adın bir fonksiyonun çalışmasını açıklayan bir fiil olması durumu hariç). Bu satır büyük harfle başlamalı ve nokta ile bitmelidir.

source: If there are more lines in the documentation string, the second line should be blank, visually separating the summary from the rest of the description. The following lines should be one or more paragraphs describing the object's calling conventions, its side effects, etc.
tr: Belgeleme string'inde daha fazla satır varsa, ikinci satır boş olmalı ve özeti açıklamanın geri kalanından görsel olarak ayırmalıdır. Sonraki satırlar, nesnenin çağrı kurallarını, yan etkilerini vb. açıklayan bir veya daha fazla paragraftan oluşmalıdır.

source: The Python parser does not strip indentation from multi-line string literals in Python, so tools that process documentation have to strip indentation if desired. This is done using the following convention. The first non-blank line *after* the first line of the string determines the amount of indentation for the entire documentation string. (We can't use the first line since it is generally adjacent to the string's opening quotes so its indentation is not apparent in the string literal.) Whitespace "equivalent" to this indentation is then stripped from the start of all lines of the string. Lines that are indented less should not occur, but if they occur all their leading whitespace should be stripped. Equivalence of whitespace should be tested after expansion of tabs (to 8 spaces, normally).
tr: Python ayrıştırıcısı, Python'daki çok satırlı dize değişmezlerinden girintiyi çıkarmaz, bu nedenle belgeleri işleyen araçların istenirse girintiyi çıkarması gerekir. Bu, aşağıdaki kural kullanılarak yapılır. Dizenin ilk satırından *sonraki* boş olmayan ilk satır, tüm dokümantasyon dizesi için girinti miktarını belirler. (İlk satırı kullanamayız, çünkü genellikle dizenin açılış tırnaklarına bitişiktir, bu nedenle girintisi dize değişmezinde belirgin değildir) Bu girintiye "eş değer" boşluk daha sonra dizenin tüm satırlarının başlangıcından çıkarılır. Daha az girintili satırlar oluşmamalıdır, ancak oluşurlarsa başlarındaki tüm boşluklar çıkarılmalıdır. Beyaz boşlukların eş değerliği sekmelerin genişletilmesinden sonra test edilmelidir (normalde 8 boşluğa kadar).

source: Here is an example of a multi-line docstring::
tr: İşte çok satırlı bir docstring örneği::

source: Function Annotations
tr: Fonksiyon Ek Açıklamaları

source: :ref:`Function annotations <function>` are completely optional metadata information about the types used by user-defined functions (see :pep:`3107` and :pep:`484` for more information).
tr: :ref:`Fonksiyon ek açıklamaları <function>` kullanıcı tanımlı fonksiyonlar tarafından kullanılan tipler hakkında tamamen isteğe bağlı meta veri bilgileridir (daha fazla bilgi için :pep:`3107` ve :pep:`484` sayfalarına bakınız).

source: Intermezzo: Coding Style
tr: Intermezzo: Kodlama Stili

source: Now that you are about to write longer, more complex pieces of Python, it is a good time to talk about *coding style*. Most languages can be written (or more concise, *formatted*) in different styles; some are more readable than others. Making it easy for others to read your code is always a good idea, and adopting a nice coding style helps tremendously for that.
tr: Artık daha uzun, daha karmaşık Python parçaları yazmak üzere olduğunuza göre, *kodlama stili* hakkında konuşmak için iyi bir zaman. Çoğu dil farklı stillerde yazılabilir (ya da daha özlü bir ifadeyle *biçimlendirilebilir*); bazıları diğerlerinden daha okunaklıdır. Başkalarının kodunuzu okumasını kolaylaştırmak her zaman iyi bir fikirdir ve güzel bir kodlama stili benimsemek buna çok yardımcı olur.

source: For Python, :pep:`8` has emerged as the style guide that most projects adhere to; it promotes a very readable and eye-pleasing coding style. Every Python developer should read it at some point; here are the most important points extracted for you:
tr: Python için :pep:`8`, çoğu projenin bağlı olduğu stil kılavuzu olarak ortaya çıkmıştır; okunabilir ve göze hoş gelen bir kodlama stilini teşvik eder. Her Python geliştiricisi bir noktada onu okumalıdır; işte sizin için çıkarılan en önemli noktalar:

source: Use 4-space indentation, and no tabs.
tr: 4 aralıklı girinti kullanın ve sekme kullanmayın.

source: 4 spaces are a good compromise between small indentation (allows greater nesting depth) and large indentation (easier to read). Tabs introduce confusion, and are best left out.
tr: 4 boşluk, küçük girinti (daha fazla iç içe geçme derinliği sağlar) ve büyük girinti (okunması daha kolay) arasında iyi bir uzlaşmadır. Sekmeler karışıklığa neden olur ve en iyisi dışarıda bırakmaktır.

source: Wrap lines so that they don't exceed 79 characters.
tr: Satırları 79 karakteri geçmeyecek şekilde sarın.

source: This helps users with small displays and makes it possible to have several code files side-by-side on larger displays.
tr: Bu, küçük ekranlı kullanıcılara yardımcı olur ve daha büyük ekranlarda birkaç kod dosyasının yan yana olmasını mümkün kılar.

source: Use blank lines to separate functions and classes, and larger blocks of code inside functions.
tr: Fonksiyonları ve sınıfları ve fonksiyonların içindeki büyük kod bloklarını ayırmak için boş satırlar kullanın.

source: When possible, put comments on a line of their own.
tr: Mümkün olduğunda, yorumları kendi başlarına bir satıra koyun.

source: Use docstrings.
tr: Docstrings kullanın.

source: Use spaces around operators and after commas, but not directly inside bracketing constructs: ``a = f(1, 2) + g(3, 4)``.
tr: Operatörlerin etrafında ve virgüllerden sonra boşluk kullanın, ancak doğrudan parantez yapılarının içinde kullanmayın: ``a = f(1, 2) + g(3, 4)``.

source: Name your classes and functions consistently; the convention is to use ``UpperCamelCase`` for classes and ``lowercase_with_underscores`` for functions and methods. Always use ``self`` as the name for the first method argument (see :ref:`tut-firstclasses` for more on classes and methods).
tr: Sınıflarınızı ve fonksiyonlarınızı tutarlı bir şekilde adlandırın; buradaki kural, sınıflar için ``UpperCamelCase``, fonksiyonlarını; metotlar için de ``lowercase_with_underscores`` kullanmaktır. İlk yöntem argümanının adı olarak her zaman ``self`` kullanın (sınıflar ve yöntemler hakkında daha fazla bilgi için :ref:`tut-firstclasses` bölümüne bakın).

source: Don't use fancy encodings if your code is meant to be used in international environments. Python's default, UTF-8, or even plain ASCII work best in any case.
tr: Kodunuz uluslararası ortamlarda kullanılacaksa süslü kodlamalar kullanmayın. Python'un varsayılanı, UTF-8 veya hatta düz ASCII her durumda en iyi sonucu verir.

source: Likewise, don't use non-ASCII characters in identifiers if there is only the slightest chance people speaking a different language will read or maintain the code.
tr: Aynı şekilde, farklı bir dil konuşan kişilerin kodu okuması veya muhafaza etmesi için en ufak bir şans varsa, tanımlayıcılarda ASCII olmayan karakterler kullanmayın.

source: Footnotes
tr: Dipnotlar

source: Actually, *call by object reference* would be a better description, since if a mutable object is passed, the caller will see any changes the callee makes to it (items inserted into a list).
tr: Aslında, *nesne referansı ile çağırma* daha iyi bir tanımlama olacaktır, çünkü değiştirilebilir bir nesne aktarılırsa, çağıran, çağırılanın üzerinde yaptığı tüm değişiklikleri (bir listeye eklenen öğeler) görecektir.
