Repository: al1can/python-docs-tr
Catalog: tutorial/controlflow.po
Languages: tr

source: More Control Flow Tools
tr: Daha Fazla Kontrol Akışı Aracı

source: :keyword:`!if` Statements
tr: :keyword:`!if` İfadeleri

source: Perhaps the most well-known statement type is the :keyword:`if` statement. For example::
tr: Belki de en iyi bilinen deyim türü :keyword:`if` deyimidir. Örneğin::

source: There can be zero or more :keyword:`elif` parts, and the :keyword:`else` part is optional. The keyword ':keyword:`!elif`' is short for 'else if', and is useful to avoid excessive indentation. An :keyword:`!if` ... :keyword:`!elif` ... :keyword:`!elif` ... sequence is a substitute for the ``switch`` or ``case`` statements found in other languages.
tr: Sıfır veya daha fazla :keyword:`elif` bölümü olabilir ve :keyword:`else` bölümü isteğe bağlıdır. ':keyword:`!elif`' anahtar sözcüğü 'else if' ifadesinin kısaltmasıdır ve aşırı girintiden kaçınmak için kullanışlıdır. Bir :keyword:`!if` ... :keyword:`!elif` ... :keyword:`!elif` ... dizisi, diğer dillerde bulunan ``switch`` veya ``case`` deyimlerinin yerine geçer.

source: If you're comparing the same value to several constants, or checking for specific types or attributes, you may also find the :keyword:`!match` statement useful. For more details see :ref:`tut-match`.
tr: Aynı değeri birkaç sabitle karşılaştırıyorsanız veya belirli türleri veya nitelikleri kontrol ediyorsanız, :keyword:`!match` deyimini de yararlı bulabilirsiniz. Daha fazla ayrıntı için :ref:`tut-match` bölümüne bakınız.

source: :keyword:`!for` Statements
tr: :keyword:`!for` İfadeleri

source: The :keyword:`for` statement in Python differs a bit from what you may be used to in C or Pascal. Rather than always iterating over an arithmetic progression of numbers (like in Pascal), or giving the user the ability to define both the iteration step and halting condition (as C), Python's :keyword:`!for` statement iterates over the items of any sequence (a list or a string), in the order that they appear in the sequence. For example (no pun intended):
tr: Python'daki :keyword:`for` deyimi, C veya Pascal'da alışkın olduğunuzdan biraz farklıdır. Her zaman sayıların aritmetik ilerlemesi üzerinde yineleme yapmak (Pascal'daki gibi) veya kullanıcıya hem yineleme adımını hem de durma koşulunu tanımlama yeteneği vermek (C gibi) yerine, Python'un :keyword:`!for` deyimi, herhangi bir dizinin (bir liste veya bir dize) öğeleri üzerinde, dizide göründükleri sırayla yineler. Örneğin (kelime oyunu yapmak istemedim):

source: Code that modifies a collection while iterating over that same collection can be tricky to get right. Instead, it is usually more straight-forward to loop over a copy of the collection or to create a new collection::
tr: Aynı koleksiyon üzerinde yineleme yaparken bir koleksiyonu değiştiren kodun doğru yazılması zor olabilir. Bunun yerine, koleksiyonun bir kopyası üzerinde döngü yapmak veya yeni bir koleksiyon oluşturmak genellikle daha kolaydır::

source: The :func:`range` Function
tr: :func:`range` Fonksiyonu

source: If you do need to iterate over a sequence of numbers, the built-in function :func:`range` comes in handy. It generates arithmetic progressions::
tr: Bir sayı dizisi üzerinde yineleme yapmanız gerekiyorsa, yerleşik :func:`range` fonksiyonu kullanışlı olur. Aritmetik ilerlemeler üretir::

source: The given end point is never part of the generated sequence; ``range(10)`` generates 10 values, the legal indices for items of a sequence of length 10. It is possible to let the range start at another number, or to specify a different increment (even negative; sometimes this is called the 'step')::
tr: Verilen bitiş noktası asla oluşturulan dizinin bir parçası değildir; ``range(10)`` 10 değer üretir, 10 uzunluğundaki bir dizinin öğeleri için yasal indisler. Aralığın başka bir sayıdan başlamasına izin vermek veya farklı bir artış (negatif bile olsa; bazen buna 'adım' denir) belirtmek mümkündür::

source: To iterate over the indices of a sequence, you can combine :func:`range` and :func:`len` as follows::
tr: Bir dizinin indisleri üzerinde yineleme yapmak için :func:`range` ve :func:`len` öğelerini aşağıdaki gibi birleştirebilirsiniz::

source: In most such cases, however, it is convenient to use the :func:`enumerate` function, see :ref:`tut-loopidioms`.
tr: Ancak bu tür durumların çoğunda :func:`enumerate` fonksiyonunu kullanmak uygundur, bkz :ref:`tut-loopidioms`.

source: A strange thing happens if you just print a range::
tr: Sadece bir aralık yazdırırsanız garip bir şey olur::

source: In many ways the object returned by :func:`range` behaves as if it is a list, but in fact it isn't. It is an object which returns the successive items of the desired sequence when you iterate over it, but it doesn't really make the list, thus saving space.
tr: Birçok yönden :func:`range` tarafından döndürülen nesne bir listeymiş gibi davranır, ancak aslında öyle değildir. Üzerinde yineleme yaptığınızda istenen dizinin ardışık öğelerini döndüren bir nesnedir, ancak listeyi gerçekten oluşturmaz, böylece yerden tasarruf sağlar.

source: We say such an object is :term:`iterable`, that is, suitable as a target for functions and constructs that expect something from which they can obtain successive items until the supply is exhausted. We have seen that the :keyword:`for` statement is such a construct, while an example of a function that takes an iterable is :func:`sum`::
tr: Böyle bir nesnenin :term:`iterable` olduğunu, yani arz tükenene kadar ardışık öğeler elde edebilecekleri bir şey bekleyen fonksiyonlar ve yapılar için bir hedef olarak uygun olduğunu söylüyoruz. Daha önce :keyword:`for` deyiminin böyle bir yapı olduğunu görmüştük, bir yinelenebilir alan bir fonksiyon örneği ise :func:`sum`::

source: Later we will see more functions that return iterables and take iterables as arguments. In chapter :ref:`tut-structures`, we will discuss in more detail about :func:`list`.
tr: Daha sonra yinelenebilirleri döndüren ve argüman olarak yinelenebilirleri alan daha fazla fonksiyon göreceğiz. :ref:`tut-structures` bölümünde, :func:`list` hakkında daha ayrıntılı olarak tartışacağız.

source: :keyword:`!pass` Statements
tr: :keyword:`!pass` İfadeleri

source: The :keyword:`pass` statement does nothing. It can be used when a statement is required syntactically but the program requires no action. For example::
tr: :keyword:`pass` deyimi hiçbir şey yapmaz. Sözdizimsel olarak bir deyim gerektiğinde ancak program hiçbir eylem gerektirmediğinde kullanılabilir. Örneğin::

source: This is commonly used for creating minimal classes::
tr: Bu genellikle minimal sınıflar oluşturmak için kullanılır::

source: Another place :keyword:`pass` can be used is as a place-holder for a function or conditional body when you are working on new code, allowing you to keep thinking at a more abstract level. The :keyword:`!pass` is silently ignored::
tr: :keyword:`pass` 'in kullanılabileceği bir başka yer de, yeni kod üzerinde çalışırken bir fonksiyon veya koşul gövdesi için bir yer tutucu olarak daha soyut bir düzeyde düşünmeye devam etmenizi sağlamaktır. :keyword:`!pass` sessizce göz ardı edilir::

source: :keyword:`!match` Statements
tr: :keyword:`!pass` İfadeleri

source: A :keyword:`match` statement takes an expression and compares its value to successive patterns given as one or more case blocks. This is superficially similar to a switch statement in C, Java or JavaScript (and many other languages), but it's more similar to pattern matching in languages like Rust or Haskell. Only the first pattern that matches gets executed and it can also extract components (sequence elements or object attributes) from the value into variables.
tr: :keyword:`match` bir ifadeyi alır ve değerini bir veya daha fazla case bloğu olarak verilen ardışık kalıplarla karşılaştırır. Bu, C, Java veya JavaScript'teki (ve diğer birçok dildeki) bir switch ifadesine yüzeysel olarak benzer, ancak Rust veya Haskell gibi dillerdeki kalıp eşleştirmeye daha çok benzer. Yalnızca eşleşen ilk kalıp yürütülür ve ayrıca bileşenleri (sıra öğeleri veya nesne nitelikleri) değerden değişkenlere çıkarabilir.

source: The simplest form compares a subject value against one or more literals::
tr: En basit form, bir konu değerini bir veya daha fazla sabitle karşılaştırır::

source: Note the last block: the "variable name" ``_`` acts as a *wildcard* and never fails to match. If no case matches, none of the branches is executed.
tr: Son bloğa dikkat edin: "değişken adı" ``_`` bir *wildcard* görevi görür ve asla eşleşmez. Hiçbir durum eşleşmezse, dallardan hiçbiri yürütülmez.

source: You can combine several literals in a single pattern using ``|`` ("or")::
tr: ``|`` ("or") kullanarak birkaç sabiti tek bir kalıpta birleştirebilirsiniz::

source: Patterns can look like unpacking assignments, and can be used to bind variables::
tr: Kalıplar paket açma atamaları gibi görünebilir ve değişkenleri bağlamak için kullanılabilir::

source: Study that one carefully! The first pattern has two literals, and can be thought of as an extension of the literal pattern shown above. But the next two patterns combine a literal and a variable, and the variable *binds* a value from the subject (``point``). The fourth pattern captures two values, which makes it conceptually similar to the unpacking assignment ``(x, y) = point``.
tr: Bunu dikkatle inceleyin! İlk kalıpta iki sabit vardır ve yukarıda gösterilen sabit kalıbının bir uzantısı olarak düşünülebilir. Ancak sonraki iki kalıp bir sabit ve bir değişkeni birleştirir ve değişken özneden (``point``) bir değer *bağlar*. Dördüncü kalıp iki değeri yakalar, bu da onu kavramsal olarak ``(x, y) = point`` paket açma atamasına benzer hale getirir.

source: If you are using classes to structure your data you can use the class name followed by an argument list resembling a constructor, but with the ability to capture attributes into variables::
tr: Verilerinizi yapılandırmak için sınıfları kullanıyorsanız, sınıf adını ve ardından bir yapıcıya benzeyen, ancak nitelikleri değişkenlere yakalama yeteneğine sahip bir argüman listesi kullanabilirsiniz::

source: You can use positional parameters with some builtin classes that provide an ordering for their attributes (e.g. dataclasses). You can also define a specific position for attributes in patterns by setting the ``__match_args__`` special attribute in your classes. If it's set to ("x", "y"), the following patterns are all equivalent (and all bind the ``y`` attribute to the ``var`` variable)::
tr: Konumsal parametreleri, nitelikleri için bir sıralama sağlayan bazı yerleşik sınıflarla (örneğin veri sınıfları) kullanabilirsiniz. Ayrıca sınıflarınızda ``__match_args__`` niteliğini ayarlayarak kalıplardaki nitelikler için belirli bir konum tanımlayabilirsiniz. Bu özellik ("x", "y") olarak ayarlanırsa, bahsi geçen kalıpların hepsi eş değerdir (ve hepsi ``y`` niteliğini ``var`` değişkenine bağlar)::

source: A recommended way to read patterns is to look at them as an extended form of what you would put on the left of an assignment, to understand which variables would be set to what. Only the standalone names (like ``var`` above) are assigned to by a match statement. Dotted names (like ``foo.bar``), attribute names (the ``x=`` and ``y=`` above) or class names (recognized by the "(...)" next to them like ``Point`` above) are never assigned to.
tr: Kalıpları okumak için önerilen bir yol, hangi değişkenlerin neye ayarlanacağını anlamak için onlara bir atamanın soluna koyacağınız şeyin genişletilmiş bir biçimi olarak bakmaktır. Yalnızca bağımsız isimler (yukarıdaki ``var`` gibi) bir eşleştirme deyimi tarafından atanır. Noktalı isimlere (``foo.bar`` gibi), nitelik isimlerine (yukarıdaki ``x=`` ve ``y=`` gibi) veya sınıf isimlerine (yukarıdaki ``Point`` gibi yanlarındaki "(...)" ile tanınan) asla atama yapılmaz.

source: We can add an ``if`` clause to a pattern, known as a "guard". If the guard is false, ``match`` goes on to try the next case block. Note that value capture happens before the guard is evaluated::
tr: Bir kalıba "guard" olarak bilinen bir ``if`` cümlesi ekleyebiliriz. Eğer guard yanlış ise, ``match`` bir sonraki case bloğunu denemeye devam eder. Değer yakalamanın koruma değerlendirilmeden önce gerçekleştiğine dikkat edin::

source: Several other key features of this statement:
tr: Bu açıklamanın diğer bazı kilit özellikleri:

source: Like unpacking assignments, tuple and list patterns have exactly the same meaning and actually match arbitrary sequences. An important exception is that they don't match iterators or strings.
tr: Paket açma atamaları gibi, tuple ve liste kalıpları da tamamen aynı anlama sahiptir ve aslında rastgele dizilerle eşleşir. Önemli bir istisna, yineleyicilerle veya string'lerle eşleşmezler.

source: Sequence patterns support extended unpacking: ``[x, y, *rest]`` and ``(x, y, *rest)`` work similar to unpacking assignments. The name after ``*`` may also be ``_``, so ``(x, y, *_)`` matches a sequence of at least two items without binding the remaining items.
tr: Sıra kalıpları genişletilmiş paket açmayı destekler: ``[x, y, *rest]`` ve ``(x, y, *rest)`` paket açma atamalarına benzer şekilde çalışır. ``*`` öğesinden sonraki ad ``_`` de olabilir, bu nedenle ``(x, y, *_)`` öğesi, kalan öğeleri bağlamadan en az iki öğeden oluşan bir diziyle eşleşir.

source: Mapping patterns: ``{"bandwidth": b, "latency": l}`` captures the ``"bandwidth"`` and ``"latency"`` values from a dictionary. Unlike sequence patterns, extra keys are ignored. An unpacking like ``**rest`` is also supported. (But ``**_`` would be redundant, so it is not allowed.)
tr: Eşleme kalıpları: ``{"bandwidth": b, "latency": l}`` bir sözlükten ``"bandwidth"`` ve ``"latency"`` değerlerini yakalar. Sıra kalıplarının aksine, ekstra anahtarlar göz ardı edilir. ``**rest`` gibi bir paket açma da desteklenir. (Ancak ``**_`` gereksiz olacağından buna izin verilmez)

source: Subpatterns may be captured using the ``as`` keyword::
tr: Alt kalıplar ``as`` anahtar sözcüğü kullanılarak yakalanabilir::

source: will capture the second element of the input as ``p2`` (as long as the input is a sequence of two points)
tr: girdinin ikinci elemanını ``p2`` olarak yakalayacaktır (girdi iki noktadan oluşan bir dizi olduğu sürece)

source: Most literals are compared by equality, however the singletons ``True``, ``False`` and ``None`` are compared by identity.
tr: Çoğu sabit eşitlikle karşılaştırılır, ancak ``True``, ``False`` ve ``None`` tekilleri özdeşlikle karşılaştırılır.

source: Patterns may use named constants. These must be dotted names to prevent them from being interpreted as capture variable::
tr: Kalıplar adlandırılmış sabitler kullanabilir. Bunlar, yakalama değişkeni olarak yorumlanmalarını önlemek için noktalı isimler olmalıdır::

source: For a more detailed explanation and additional examples, you can look into :pep:`636` which is written in a tutorial format.
tr: Daha ayrıntılı bir açıklama ve ek örnekler için, öğretici bir formatta yazılmış olan :pep:`636` sayfasına bakabilirsiniz.

source: Defining Functions
tr: Fonksiyonların Tanımlanması

source: We can create a function that writes the Fibonacci series to an arbitrary boundary::
tr: Fibonacci serisini rastgele bir sınıra kadar yazan bir fonksiyon oluşturabiliriz::

source: The keyword :keyword:`def` introduces a function *definition*. It must be followed by the function name and the parenthesized list of formal parameters. The statements that form the body of the function start at the next line, and must be indented.
tr: Anahtar kelime :keyword:`def` bir fonksiyon *tanımını* tanıtır. Bunu fonksiyon adı ve parantez içine alınmış resmi parametreler listesi takip etmelidir. Fonksiyonun gövdesini oluşturan ifadeler bir sonraki satırdan başlar ve girintili olmalıdır.

source: The first statement of the function body can optionally be a string literal; this string literal is the function's documentation string, or :dfn:`docstring`. (More about docstrings can be found in the section :ref:`tut-docstrings`.) There are tools which use docstrings to automatically produce online or printed documentation, or to let the user interactively browse through code; it's good practice to include docstrings in code that you write, so make a habit of it.
tr: Fonksiyon gövdesinin ilk ifadesi isteğe bağlı olarak bir string literal olabilir; bu string literal fonksiyonun dokümantasyon stringi veya :dfn:`docstring` 'dir. (Docstringler hakkında daha fazla bilgi :ref:`tut-docstrings` bölümünde bulunabilir.) Otomatik olarak çevrimiçi veya basılı dokümantasyon üretmek veya kullanıcının etkileşimli olarak kodda gezinmesini sağlamak için docstringleri kullanan araçlar vardır; yazdığınız koda docstringler eklemek iyi bir uygulamadır, bu yüzden bunu alışkanlık haline getirin.

source: The *execution* of a function introduces a new symbol table used for the local variables of the function. More precisely, all variable assignments in a function store the value in the local symbol table; whereas variable references first look in the local symbol table, then in the local symbol tables of enclosing functions, then in the global symbol table, and finally in the table of built-in names. Thus, global variables and variables of enclosing functions cannot be directly assigned a value within a function (unless, for global variables, named in a :keyword:`global` statement, or, for variables of enclosing functions, named in a :keyword:`nonlocal` statement), although they may be referenced.
tr: Bir fonksiyonun *çalıştırılması*, fonksiyonun yerel değişkenleri için kullanılan yeni bir sembol tablosu ortaya çıkarır. Daha açık bir ifadeyle, bir fonksiyon içindeki tüm değişken atamaları değeri yerel sembol tablosunda saklar; oysa değişken referansları önce yerel sembol tablosuna, sonra çevreleyen fonksiyonların yerel sembol tablolarına, daha sonra global sembol tablosuna ve son olarak da yerleşik isimler tablosuna bakar. Bu nedenle, global değişkenlere ve çevreleyen fonksiyonların değişkenlerine bir fonksiyon içinde doğrudan değer atanamaz (global değişkenler için bir :keyword:`global` deyiminde veya çevreleyen fonksiyonların değişkenleri için bir :keyword:`nonlocal` deyiminde isimlendirilmedikçe), ancak bunlara referans verilebilir.

source: The actual parameters (arguments) to a function call are introduced in the local symbol table of the called function when it is called; thus, arguments are passed using *call by value* (where the *value* is always an object *reference*, not the value of the object). [#]_ When a function calls another function, or calls itself recursively, a new local symbol table is created for that call.
tr: Bir fonksiyon çağrısının gerçek parametreleri (argümanları), çağrıldığında çağrılan fonksiyonun yerel sembol tablosunda tanıtılır; bu nedenle, argümanlar *call by value* (burada *value* her zaman bir nesne *referans*'dır, nesnenin değeri değildir) kullanılarak aktarılır. [#]_ Bir fonksiyon başka bir fonksiyonu çağırdığında veya kendini tekrarlı olarak çağırdığında, bu çağrı için yeni bir yerel sembol tablosu oluşturulur.

source: A function definition associates the function name with the function object in the current symbol table. The interpreter recognizes the object pointed to by that name as a user-defined function. Other names can also point to that same function object and can also be used to access the function::
tr: Bir fonksiyon tanımı, fonksiyon adını geçerli sembol tablosundaki fonksiyon nesnesiyle ilişkilendirir. Yorumlayıcı, bu adın işaret ettiği nesneyi kullanıcı tanımlı bir fonksiyon olarak tanır. Diğer isimler de aynı fonksiyon nesnesine işaret edebilir ve fonksiyona erişmek için kullanılabilir::

source: Coming from other languages, you might object that ``fib`` is not a function but a procedure since it doesn't return a value. In fact, even functions without a :keyword:`return` statement do return a value, albeit a rather boring one. This value is called ``None`` (it's a built-in name). Writing the value ``None`` is normally suppressed by the interpreter if it would be the only value written. You can see it if you really want to using :func:`print`::
tr: Diğer dillerden geliyorsanız, ``fib`` 'in bir fonksiyon değil, değer döndürmediği için bir prosedür olduğuna itiraz edebilirsiniz. Aslında, :keyword:`return` ifadesi olmayan fonksiyonlar bile, oldukça sıkıcı olsa da, bir değer döndürürler. Bu değer ``None`` olarak adlandırılır (yerleşik bir isimdir). Normalde ``None`` değerinin yazılması, yazılan tek değer olacaksa yorumlayıcı tarafından bastırılır. Eğer gerçekten istiyorsanız :func:`print` kullanarak görebilirsiniz::

source: It is simple to write a function that returns a list of the numbers of the Fibonacci series, instead of printing it::
tr: Fibonacci serisindeki sayıların listesini döndürebilecek bir fonksiyon yazmak gayet basittir, onun yerine şunu yazdırarak::

source: This example, as usual, demonstrates some new Python features:
tr: Bu örnek, her zamanki gibi, bazı yeni Python özelliklerini göstermektedir:

source: The :keyword:`return` statement returns with a value from a function. :keyword:`!return` without an expression argument returns ``None``. Falling off the end of a function also returns ``None``.
tr: Bir :keyword:`return` deyimi bir fonksiyondan bir değerle döner. :keyword:`!return` deyimi bir ifade argümanı olmadan ``None`` döndürür. Bir fonksiyonun sonundan düşmek de ``None`` değerini döndürür.

source: More on Defining Functions
tr: İşlev Tanımlama hakkında daha fazla bilgi

source: It is also possible to define functions with a variable number of arguments. There are three forms, which can be combined.
tr: Değişken sayıda argüman içeren fonksiyonlar tanımlamak da mümkündür. Birleştirilebilen üç form vardır.

source: Default Argument Values
tr: Varsayılan Değişken Değerleri

source: The most useful form is to specify a default value for one or more arguments. This creates a function that can be called with fewer arguments than it is defined to allow. For example::
tr: En kullanışlı biçim, bir veya daha fazla bağımsız değişken için varsayılan bir değer belirtmektir. Bu, izin vermek üzere tanımlandığından daha az sayıda bağımsız değişkenle çağrılabilen bir fonksiyon oluşturur. Örneğin::

source: This function can be called in several ways:
tr: Bu fonksiyon çeşitli yollarla çağrılabilir:

source: giving only the mandatory argument: ``ask_ok('Do you really want to quit?')``
tr: sadece zorunlu argümanı vererek: ``ask_ok('Gerçekten çıkmak istiyor musun?')``

source: giving one of the optional arguments: ``ask_ok('OK to overwrite the file?', 2)``
tr: isteğe bağlı değişkenlerden birini vermek: ``ask_ok('OK to overwrite the file?', 2)``

source: or even giving all arguments: ``ask_ok('OK to overwrite the file?', 2, 'Come on, only yes or no!')``
tr: ya da bütün değişkenleri vermek: ``ask_ok('OK to overwrite the file?', 2, 'Come on, only yes or no!')``

source: This example also introduces the :keyword:`in` keyword. This tests whether or not a sequence contains a certain value.
tr: Bu örnek ayrıca :keyword:`in` anahtar sözcüğünü de tanıtır. Bu, bir dizinin belirli bir değer içerip içermediğini test eder.

source: The default values are evaluated at the point of function definition in the *defining* scope, so that ::
tr: Varsayılan değerler *tanımlayan* kapsamdaki fonksiyon tanımlama noktasında değerlendirilir, böylece ::

source: will print ``5``.
tr: ``5`` çıktısını verecektir.
