Repository: al1can/python-docs-tr
Catalog: tutorial/stdlib.po
Languages: tr

source: Brief Tour of the Standard Library
tr: Standart Kütüphanenin Özeti

source: Operating System Interface
tr: İşletim Sistemi Arayüzü

source: The :mod:`os` module provides dozens of functions for interacting with the operating system::
tr: :mod:`os` modülü, işletim sistemiyle etkileşim kurmak için düzinelerce fonksiyon sağlar::

source: Be sure to use the ``import os`` style instead of ``from os import *``. This will keep :func:`os.open` from shadowing the built-in :func:`open` function which operates much differently.
tr: ``from os import *`` yerine ``import os`` stilini kullandığınızdan emin olun. Yanlış kullanım olan ilk stili tercih etmek, :func:`os.open` 'ın çok daha farklı çalışan gömülü :func:`open` fonksiyonunu gölgelemesine neden olur.

source: The built-in :func:`dir` and :func:`help` functions are useful as interactive aids for working with large modules like :mod:`os`::
tr: Gömülü :func:`dir` ve :func:`help` fonksiyonları :mod:`os` gibi büyük modüllerle çalışma konusunda interaktif yardımcılar olarak kullanışlıdır::

source: For daily file and directory management tasks, the :mod:`shutil` module provides a higher level interface that is easier to use::
tr: Günlük dosya ve dizin yönetimi görevleri için :mod:`shutil` modülü kullanımı daha kolay olan daha yüksek düzeyli (higher level) bir arayüz sağlar::

source: File Wildcards
tr: Dosya Joker Karakterleri

source: The :mod:`glob` module provides a function for making file lists from directory wildcard searches::
tr: :mod:`glob` modülü , klasör joker karakter aramalarından dosya listeleri oluşturabilmek için bir fonsiyon sağlar::

source: Command Line Arguments
tr: Komut Satırı Argümanları

source: The :mod:`argparse` module provides a more sophisticated mechanism to process command line arguments. The following script extracts one or more filenames and an optional number of lines to be displayed::
tr: :mod:`argparse` modülü, komut satırı argümanlarını işlemek için daha sofistike bir yöntem sağlar. Aşağıdaki program, bir veya birden fazla dosya adını ve isteğe bağlı görüntülenecek satır sayısını ayıklar::

source: When run at the command line with ``python top.py --lines=5 alpha.txt beta.txt``, the script sets ``args.lines`` to ``5`` and ``args.filenames`` to ``['alpha.txt', 'beta.txt']``.
tr: Komut satırında ``python top.py --lines=5 alpha.txt beta.txt`` çalıştırıldığı zaman program, ``args.lines`` ögesini ``5`` ve ``args.filenames`` ögesini ``['alpha.txt', 'beta.txt']`` olarak ayarlar.

source: Error Output Redirection and Program Termination
tr: Hata Çıktısının Yeniden Yönlendirilmesi ve Programın Sonlandırılması

source: The :mod:`sys` module also has attributes for *stdin*, *stdout*, and *stderr*. The latter is useful for emitting warnings and error messages to make them visible even when *stdout* has been redirected::
tr: :mod:`sys` modülü ayrıca *stdin*, *stdout* ve *stderr* özelliklerine sahiptir. İkincisi, *stdout* yeniden yönlendirilmiş olsa bile bunları görünür hale getirmek için uyarılar ve hata iletileri yayımlamak için yararlıdır::

source: The most direct way to terminate a script is to use ``sys.exit()``.
tr: Bir programı sonlandırmak için, en kısa yol olan ``sys.exit()`` komutunu kullanın.

source: String Pattern Matching
tr: String Örüntü Eşlemesi

source: The :mod:`re` module provides regular expression tools for advanced string processing. For complex matching and manipulation, regular expressions offer succinct, optimized solutions::
tr: :mod:`re` modülü, gelişmiş string işleme için kurallı ifade araçları sağlar. Karmaşık eşleme ve manipülasyon için, kurallı ifadeler kısa ve optimize edilmiş çözümler sunar::

source: When only simple capabilities are needed, string methods are preferred because they are easier to read and debug::
tr: Basit işlemlerde "string" metodu önerilir çünkü okuması ve hata ayıklaması daha kolaydır::

source: Mathematics
tr: Matematik

source: The :mod:`random` module provides tools for making random selections::
tr: :mod:`random` modülü rastgele seçimler yapmak için araçlar sağlar::

source: The :mod:`statistics` module calculates basic statistical properties (the mean, median, variance, etc.) of numeric data::
tr: :mod:`statistics` modülü sayı içeren veriler için temel istatistiksel özellikleri hesaplar (ortalama, ortanca, fark, vb.)::

source: The SciPy project <https://scipy.org> has many other modules for numerical computations.
tr: SciPy projesi <https://scipy.org> sayısal hesaplamalar için daha fazla modül içerir.

source: Internet Access
tr: İnternet Erişimi

source: There are a number of modules for accessing the internet and processing internet protocols. Two of the simplest are :mod:`urllib.request` for retrieving data from URLs and :mod:`smtplib` for sending mail::
tr: İnternete bağlanmak ve internet protokollerini işlemek için bazı modüller var. Bunlardan en basit ikisi; :mod:`urllib.request` URL'lerden veri çekmek, ve :mod:`smtplib` ise mail göndermek için::

source: (Note that the second example needs a mailserver running on localhost.)
tr: (İkinci örnek için bir mail sunucusunun localhost'ta çalışması gerektiğini unutmayın.)

source: Dates and Times
tr: Tarihler ve Saatler

source: The :mod:`datetime` module supplies classes for manipulating dates and times in both simple and complex ways. While date and time arithmetic is supported, the focus of the implementation is on efficient member extraction for output formatting and manipulation. The module also supports objects that are timezone aware. ::
tr: :mod:`datetime` modülü, tarihleri ve saatleri hem basit hem de karmaşık şekillerde işlemek için sınıflar sağlar. Tarih ve saat aritmetiği desteklenirken, uygulamanın odak noktası çıktı biçimlendirmesi ve düzenlemesi için verimli üye ayıklamadır. Modül ayrıca saat dilimi farkında olan nesneleri de destekler. ::

source: Data Compression
tr: Veri Sıkıştırma

source: Common data archiving and compression formats are directly supported by modules including: :mod:`zlib`, :mod:`gzip`, :mod:`bz2`, :mod:`lzma`, :mod:`zipfile` and :mod:`tarfile`. ::
tr: Genel veri arşivleme ve sıkıştırma formatları şu modüller tarafından desteklenir: :mod:`zlib`, :mod:`gzip`, :mod:`bz2`, :mod:`lzma`, :mod:`zipfile` ve :mod:`tarfile`. ::

source: Performance Measurement
tr: Performans Ölçümü

source: Some Python users develop a deep interest in knowing the relative performance of different approaches to the same problem. Python provides a measurement tool that answers those questions immediately.
tr: Bazı Python kullanıcıları, aynı soruna farklı yaklaşımların göreli performansını bilmek konusunda derin bir ilgi geliştirir. Python, bu soruları hemen yanıtlayan bir ölçüm aracı sağlar.

source: For example, it may be tempting to use the tuple packing and unpacking feature instead of the traditional approach to swapping arguments. The :mod:`timeit` module quickly demonstrates a modest performance advantage::
tr: Örneğin, argümanları değiştirmek için geleneksel yaklaşım yerine dizi paketleme ve açma özelliğini kullanmak cazip olabilir. :mod:`timeit` modülü hızla sade bir performans avantajı gösterir::

source: In contrast to :mod:`timeit`'s fine level of granularity, the :mod:`profile` and :mod:`pstats` modules provide tools for identifying time critical sections in larger blocks of code.
tr: :mod:`timeit` 'in ince ayrıntı düzeyinin aksine, :mod:`profile` ve :mod:`pstats` modülleri, daha büyük kod bloklarında zaman açısından kritik bölümleri tanımlamak için araçlar sağlar.

source: Quality Control
tr: Kalite Kontrolü

source: One approach for developing high quality software is to write tests for each function as it is developed and to run those tests frequently during the development process.
tr: Yüksek kalitede yazılımlar geliştirmek için her fonksiyon için testler yazılmalıdır ve bu testler geliştirirken sık sık çalıştırmalıdır.

source: The :mod:`doctest` module provides a tool for scanning a module and validating tests embedded in a program's docstrings. Test construction is as simple as cutting-and-pasting a typical call along with its results into the docstring. This improves the documentation by providing the user with an example and it allows the doctest module to make sure the code remains true to the documentation::
tr: :mod:`doctest` modülü, bir modülü taramak ve bir programın docstrings'ine gömülü testleri doğrulamak için bir araç sağlar. Test yapısı, sonuçlarıyla birlikte tipik bir çağrıyı docstring'e kesip yapıştırma kadar basittir. Bu, kullanıcıya bir örnek sunarak dokümantasyonu geliştirir ve doctest modülünün kodun dokümantasyona göre doğru olduğundan emin olmasını sağlar::

source: The :mod:`unittest` module is not as effortless as the :mod:`doctest` module, but it allows a more comprehensive set of tests to be maintained in a separate file::
tr: :mod:`unittest` modülü, :mod:`doctest` modülü gibi çaba istemeyen bir modül değildir ama daha geniş kapsamlı test setlerinin ayrı dosyalarda sağlanmasına imkân verir::

source: Batteries Included
tr: Bataryalar Dahildir

source: Python has a "batteries included" philosophy. This is best seen through the sophisticated and robust capabilities of its larger packages. For example:
tr: Python'un "bataryalar dahil" felsefesi vardır. Bu , büyük paketlerin en iyi şekilde sofistike ve sağlam kapabiliteleriyle görülür. Mesela:

source: The :mod:`xmlrpc.client` and :mod:`xmlrpc.server` modules make implementing remote procedure calls into an almost trivial task. Despite the modules' names, no direct knowledge or handling of XML is needed.
tr: :mod:`xmlrpc.client` ve :mod:`xmlrpc.server` modülleri, uzak işlem grubu çağrılarını uygulamayı neredeyse önemsiz bir görev haline getirir. Modül adlarına rağmen, XML'nin doğrudan bilgisine veya işlenmesine gerek yoktur.

source: The :mod:`email` package is a library for managing email messages, including MIME and other :rfc:`2822`-based message documents. Unlike :mod:`smtplib` and :mod:`poplib` which actually send and receive messages, the email package has a complete toolset for building or decoding complex message structures (including attachments) and for implementing internet encoding and header protocols.
tr: :mod:`email` paketi e-mail mesajlarını işlemek için bir kütüphanedir.MIME ve diğer :rfc:`2822`-tabanlı mesajların dokümanlarını içerir. Mesaj gönderip alan :mod:`smtplib` ve :mod:`poplib` 'in aksine, e-mail paketinin derleme işlemini, kompleks mesaj yapılarının (ekler dahil) decode edilebilmesini sağlayan, internet encode işlemini ve header protokollerini uygulamak için geniş kapsamlı bir toolkit'e sahiptir.

source: The :mod:`json` package provides robust support for parsing this popular data interchange format. The :mod:`csv` module supports direct reading and writing of files in Comma-Separated Value format, commonly supported by databases and spreadsheets. XML processing is supported by the :mod:`xml.etree.ElementTree`, :mod:`xml.dom` and :mod:`xml.sax` packages. Together, these modules and packages greatly simplify data interchange between Python applications and other tools.
tr: :mod:`json` paketi, bu popüler veri değişim biçimini ayrıştırmak için sağlam destek sağlar. :mod:`csv` modülü, genellikle veritabanları ve elektronik tablolar tarafından desteklenen Virgülle-Ayrılmış Değer biçimindeki dosyaların doğrudan okunmasını ve yazılmasını destekler. XML işleme :mod:`xml.etree.ElementTree`, :mod:`xml.dom` ve :mod:`xml.sax` paketleri tarafından desteklenir. Birlikte, bu modüller ve paketler Python uygulamaları ve diğer araçlar arasındaki veri değişimini büyük ölçüde basitleştirir.

source: The :mod:`sqlite3` module is a wrapper for the SQLite database library, providing a persistent database that can be updated and accessed using slightly nonstandard SQL syntax.
tr: :mod:`sqlite3` modülü , SQLite veritabanı kütüphanesi için bir wrapper'dır. Biraz standart dışı SQL syntax'ları kullanılarak güncellenebilen ve erişilebilen kalıcı bir veritabanı sağlanabilir.

source: Internationalization is supported by a number of modules including :mod:`gettext`, :mod:`locale`, and the :mod:`codecs` package.
tr: Uluslararasılaştırma :mod:`gettext`, :mod:`locale` ve :mod:`codecs` paketi dahil olmak üzere bir dizi modül tarafından desteklenir.
