Repository: al1can/python-docs-tr
Catalog: library/asyncio.po
Languages: tr

source: High-level APIs
tr: Yüksek seviye API'lar

source: Low-level APIs
tr: Düşük seviye API'lar

source: Guides and Tutorials
tr: Rehberler ve Eğitimler

source: :mod:`!asyncio` --- Asynchronous I/O
tr: :mod:`!asyncio` --- Eşzamansız I/O

source: Hello World!
tr: Merhaba Dünya!

source: asyncio is a library to write **concurrent** code using the **async/await** syntax.
tr: asyncio **async/await** sözdizimini kullanarak **eş zamanlı** kod yazmak için kullanılan bir kütüphanedir.

source: asyncio is used as a foundation for multiple Python asynchronous frameworks that provide high-performance network and web-servers, database connection libraries, distributed task queues, etc.
tr: asyncio yüksek performanslı ağ ve web sunucuları , veritabanı bağlantı kütüphaneleri , dağıtık görev kuyrukları vb. pek çok Python eş zamanlı çatısı için bir temel olarak kullanılmıştır.

source: asyncio is often a perfect fit for IO-bound and high-level **structured** network code.
tr: asyncio, IO ağırlıklı ve yüksek seviyeli **yapılandırılmış** ağ kodu için genellikle mükemmel bir seçimdir.

source: asyncio provides a set of **high-level** APIs to:
tr: asyncio aşağıdakiler için bir takım **yüksek seviyeli** API'lar sağlar:

source: :ref:`run Python coroutines <coroutine>` concurrently and have full control over their execution;
tr: :ref:`Python coroutine'lerini <coroutine>` eş zamanlı olarak çalıştırın ve yürütmeleri üzerinde tam kontrole sahip olun;

source: perform :ref:`network IO and IPC <asyncio-streams>`;
tr: :ref:`ağ IO ve IPC <asyncio-streams>` gerçekleştirimi;

source: control :ref:`subprocesses <asyncio-subprocess>`;
tr: :ref:`alt işlemlerin <asyncio-subprocess>` kontrolü;

source: distribute tasks via :ref:`queues <asyncio-queues>`;
tr: :ref:`kuyruklar <asyncio-queues>` aracılığı ile görevlerin dağıtımı;

source: :ref:`synchronize <asyncio-sync>` concurrent code;
tr: eş zamanlı kodun :ref:`senkronize edilmesi <asyncio-sync>`;

source: Additionally, there are **low-level** APIs for *library and framework developers* to:
tr: Ek olarak , kütüphane ve dil çatısı geliştiricileri için **düşük seviyeli** API'lar bulunmaktadır:

source: create and manage :ref:`event loops <asyncio-event-loop>`, which provide asynchronous APIs for :ref:`networking <loop_create_server>`, running :ref:`subprocesses <loop_subprocess_exec>`, handling :ref:`OS signals <loop_add_signal_handler>`, etc;
tr: :ref:`ağ <loop_create_server>`, :ref:`alt işlemler <loop_subprocess_exec>` çalıştırmak, :ref:`işletim sistemi sinyallerini <loop_add_signal_handler>` işlemek vb. işlemler için asenkron API'ler sağlayan :ref:`olay döngüleri <asyncio-event-loop>` oluşturun ve yönetin;

source: implement efficient protocols using :ref:`transports <asyncio-transports-protocols>`;
tr: :ref:`aktarımları <asyncio-transports-protocols>` kullanarak verimli protokoller uygulayın ;

source: :ref:`bridge <asyncio-futures>` callback-based libraries and code with async/await syntax.
tr: geribildirim tabanlı kütüphane ve kodları :ref:`köprüleyerek <asyncio-futures>` async/await sözdizimi ile birleştirin.

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
tr: Bu modül ``wasm32-emscripten`` ve ``wasm32-wasi`` WebAssembly platformları üzerinde çalışmaz veya mevcut değildir. Daha fazla bilgi için :ref:`wasm-availability` bölümüne bakınız.

source: You can experiment with an ``asyncio`` concurrent context in the REPL:
tr: REPL üzerinde ``asyncio`` ile eşzamanlı bağlamda denemeler yapabilirsiniz:

source: Reference
tr: Referans

source: The source code for asyncio can be found in :source:`Lib/asyncio/`.
tr: Asyncio için kaynak kodu :source:`Lib/asyncio/` dizininde bulunabilir.
