Repository: al1can/python-docs-tr
Catalog: library/glob.po
Languages: tr

source: :mod:`!glob` --- Unix style pathname pattern expansion
tr: :mod:`!glob` --- Unix tarzı yol adı kalıp açılımı

source: **Source code:** :source:`Lib/glob.py`
tr: **Kaynak kod** :source:`Lib/glob.py`

source: The :mod:`glob` module finds all the pathnames matching a specified pattern according to the rules used by the Unix shell, although results are returned in arbitrary order. No tilde expansion is done, but ``*``, ``?``, and character ranges expressed with ``[]`` will be correctly matched. This is done by using the :func:`os.scandir` and :func:`fnmatch.fnmatch` functions in concert, and not by actually invoking a subshell.
tr: :mod:`glob` modülü Unix kabuğu tarafından kullanılan kurallarına uyarak spesifik desenlerle eşleşen tüm yol adlarını bulur ve sonucu gelişigüzel bir sırada ile döndürür. Tilde açılımı yapılmaz fakat ``[]`` içinde ifade edilen karakter aralığı ve ``*``, ``?`` karakterleri eşleştirilir. Bu işlem :func:`os.scandir` ve :func:`fnmatch.fnmatch` fonksiyonlarının birlikte çalışması ile olur ve bir altkabuk çağırılmaz.

source: Note that files beginning with a dot (``.``) can only be matched by patterns that also start with a dot, unlike :func:`fnmatch.fnmatch` or :func:`pathlib.Path.glob`. (For tilde and shell variable expansion, use :func:`os.path.expanduser` and :func:`os.path.expandvars`.)
tr: Dikkat edilmeli ki func:`fnmatch.fnmatch` veya :func:`pathlib.Path.glob` aksine, nokta (``.``) ile başlayan dosyalar sadece nokta ile başlayan desenler ile eşleştirilebilir. (Tilde ve kabuk değişken açılımları için :func:`os.path.expanduser` ve :func:`os.path.expandvars` kullanın.

source: For a literal match, wrap the meta-characters in brackets. For example, ``'[?]'`` matches the character ``'?'``.
tr: Harfi harfine eşleşme için meta-karakter'leri köşeli parantez içine koyun. Örneğin, ``'[?]'`` deseni ``'?'`` karakteri ile eşleşir.

source: The :mod:`pathlib` module offers high-level path objects.
tr: :mod:`pathlib` modülü yüksek-seviye dizin yolu nesneleri döndürür.

source: Return a possibly empty list of path names that match *pathname*, which must be a string containing a path specification. *pathname* can be either absolute (like :file:`/usr/src/Python-1.5/Makefile`) or relative (like :file:`../../Tools/\*/\*.gif`), and can contain shell-style wildcards. Broken symlinks are included in the results (as in the shell). Whether or not the results are sorted depends on the file system. If a file that satisfies conditions is removed or added during the call of this function, whether a path name for that file will be included is unspecified.
tr: *pathname* ile eşleşen bir liste döndürür ve bu boş liste de olabilir. *pathname*, dizin yolu belirtimi içeren bir string olmalıdır. *pathname* hem mutlak (örneğin :file:`/usr/src/Python-1.5/Makefile`) hem de göreceli (örneğin :file:`../../Tools/\*/\*.gif`) olabilir ve kabuk-tarzı joker karakterler de içerebilir. Bozuk sembolik bağlantılar de sonuçlara dahil edilir (kabukta olduğu gibi). Sonucun sıralanmış olup olmaması dosya sistemine bağlıdır. Eğer eşleşmeye uyan bir dosya bu fonksiyonun çağrılması sırasında kaldırılırsa veya eklenirse dönüş değerinde dosyanın bulunup bulunmayacağı belirsizdir.

source: If *root_dir* is not ``None``, it should be a :term:`path-like object` specifying the root directory for searching. It has the same effect on :func:`glob` as changing the current directory before calling it. If *pathname* is relative, the result will contain paths relative to *root_dir*.
tr: Eğer *root_dir* ``None`` değil ise arama için kök dizini belirten :term:`yol benzeri nesne` olmalıdır. Fonksiyonu çağırmadan önce geçerli dizini değiştirmek ile aynı etkiyi yaratır. Eğer *pathname* göreceli ise sonuç *root_dir* dizinine dayanan dizinleri içerir.

source: This function can support :ref:`paths relative to directory descriptors <dir_fd>` with the *dir_fd* parameter.
tr: Bu fonksiyon *dir_fd* parametresi ile :ref:`dizin tanımlayıcılarına göre dosya yolları <dir_fd>` destekler .

source: If *recursive* is true, the pattern "``**``" will match any files and zero or more directories, subdirectories and symbolic links to directories. If the pattern is followed by an :data:`os.sep` or :data:`os.altsep` then files will not match.
tr: Eğer *recursive* True ise "``**``" deseni tüm dosyaları ve sıfır veya daha fazla dizin, alt dizin ve dizinlere işaret eden sembolik bağlantılarla eşleşir. Eğer desen ardından :data:`os.sep` veya :data:`os.altsep` gelirse dosyalar eşlenmez.

source: If *include_hidden* is true, "``**``" pattern will match hidden directories.
tr: Eğer *include_hidden* True ise, "``**``" deseni gizli dizinleri de eşler.

source: Raises an :ref:`auditing event <auditing>` ``glob.glob`` with arguments ``pathname``, ``recursive``.
tr: ``pathname``, ``recursive`` argümanları ile ``glob.glob`` fonksiyonu için bir :ref:`denetim olayı <auditing>` tetikler.

source: Raises an :ref:`auditing event <auditing>` ``glob.glob/2`` with arguments ``pathname``, ``recursive``, ``root_dir``, ``dir_fd``.
tr: ``pathname``, ``recursive`` , ``root_dir``, ``dir_fd`` argümanları ile ``glob.glob/2`` fonksiyonu için bir :ref:`denetim olayı <auditing>` tetikler.

source: Using the "``**``" pattern in large directory trees may consume an inordinate amount of time.
tr: "``**``" deseninin geniş dizin ağaçlarıyla kullanımı aşırı derecede zaman harcar.

source: This function may return duplicate path names if *pathname* contains multiple "``**``" patterns and *recursive* is true.
tr: Eğer *pathname* birden fazla "``**``" deseni içerirse ve *recursive* True ise fonksiyon tekrar eden yol adları döndürebilir.

source: Support for recursive globs using "``**``".
tr: "``**``" kullanarak yinelemeli glob'lar için destek eklendi.

source: Added the *root_dir* and *dir_fd* parameters.
tr: *root_dir* ve *dir_fd* parametreleri eklendi.

source: Added the *include_hidden* parameter.
tr: *include_hidden* parametresi eklendi.

source: Return an :term:`iterator` which yields the same values as :func:`glob` without actually storing them all simultaneously.
tr: :func:`glob` fonksiyonuyla aynı değerleri döndüren fakat eş zamanlı olarak saklamayan bir :term:`yineleyici` döndürür.

source: Escape all special characters (``'?'``, ``'*'`` and ``'['``). This is useful if you want to match an arbitrary literal string that may have special characters in it. Special characters in drive/UNC sharepoints are not escaped, e.g. on Windows ``escape('//?/c:/Quo vadis?.txt')`` returns ``'//?/c:/Quo vadis[?].txt'``.
tr: Tüm özel karakterlerden (``'?'``, ``'*'`` and ``'['``) kaçar. Eğer özel karakterler içerme ihtimali olan belirsiz bir dizini harfi harfine eşleştirmek istiyorsanız faydalıdır. Sürücü/UNC paylaşım noktalarındaki özel karakterler kaçırılamaz; örneğin Windows'ta ``escape('//?/c:/Quo vadis?.txt')`` ``'//?/c:/Quo vadis[?].txt'`` döndürür.

source: For example, consider a directory containing the following files: :file:`1.gif`, :file:`2.txt`, :file:`card.gif` and a subdirectory :file:`sub` which contains only the file :file:`3.txt`. :func:`glob` will produce the following results. Notice how any leading components of the path are preserved. ::
tr: Örneğin, :file:`1.gif`, :file:`2.txt`, :file:`card.gif` dosyalarını içeren bir dizin ve :file:`sub` adında sadece :file:`3.txt` dosyasını içeren bir alt dizin düşünün. :func:`glob` aşağıdaki sonuçları üretir. Yolun başlangıç bileşenlerinin nasıl korunduğuna dikkat edin.

source: If the directory contains files starting with ``.`` they won't be matched by default. For example, consider a directory containing :file:`card.gif` and :file:`.card.gif`::
tr: Eğer dizin ``.`` ile başlayan dosyalar içeriyorsa varsayılan olarak eşleştirilmezler. Örneğin, :file:`card.gif` and :file:`.card.gif`:: dosyalarını içeren bir dizin düşünün.

source: Module :mod:`fnmatch`
tr: Modül :mod:`fnmatch`

source: Shell-style filename (not path) expansion
tr: Kabuk-tarzı dosya ismi (yol adı değil) açılımı

source: filenames
tr: dosya adları

source: pathname expansion
tr: yol adı açılımı

source: in glob-style wildcards
tr: in glob-tarzı joker karakterleri
